In [1]:
import warnings
warnings.filterwarnings(action='ignore') 

import pandas as pd
import numpy as np
import csv
import folium
import matplotlib.pyplot as plt
plt.rc('font',family='D2CodingLigature Nerd Font')

### 통계함수

In [4]:
df = pd.DataFrame({'test': [45,30,40,37,48]})
df.count()

test    5
dtype: int64

In [8]:
df = pd.DataFrame({'test': [45,30,40,37,48], 'test1':[10, 20, 30, np.nan, 100]})
df.count()      # 결측값 제외

test     5
test1    4
dtype: int64

In [9]:
df.sum()

test     200.0
test1    160.0
dtype: float64

In [ ]:
df.cumsum()     # 누적합

   test  test1
0    45   10.0
1    75   30.0
2   115   60.0
3   152    NaN
4   200  160.0

In [ ]:
df.mean()       # 각각 열의 평균

test     40.0
test1    40.0
dtype: float64

In [ ]:
df.std().round(2)       # 표준편차, 소숫점 2자리까지

test      7.04
test1    40.82
dtype: float64

In [ ]:
df.var()    # 분산

test       49.500000
test1    1666.666667
dtype: float64

In [ ]:
df.max()    # 최대값

test      48.0
test1    100.0
dtype: float64

In [15]:
df.min()    # 최소값

test     30.0
test1    10.0
dtype: float64

In [ ]:
df.describe()   # 알아서 특정값들을 보여준다

            test       test1
count   5.000000    4.000000
mean   40.000000   40.000000
std     7.035624   40.824829
min    30.000000   10.000000
25%    37.000000   17.500000
50%    40.000000   25.000000
75%    45.000000   47.500000
max    48.000000  100.000000

In [19]:
df = pd.DataFrame({'name':['kim','lee','hong','seo','jang'],
                   'test': [45, 30, 40, 37, 48],
                   'assign1': [20, 17, 22, 18, 24],
                   'assign2': [19, 14, 18, 15, 25]})
df

   name  test  assign1  assign2
0   kim    45       20       19
1   lee    30       17       14
2  hong    40       22       18
3   seo    37       18       15
4  jang    48       24       25

In [ ]:
df.describe()   # 숫자로된 열만 계산해 준다

            test    assign1   assign2
count   5.000000   5.000000   5.00000
mean   40.000000  20.200000  18.20000
std     7.035624   2.863564   4.32435
min    30.000000  17.000000  14.00000
25%    37.000000  18.000000  15.00000
50%    40.000000  20.000000  18.00000
75%    45.000000  22.000000  19.00000
max    48.000000  24.000000  25.00000

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     5 non-null      object
 1   test     5 non-null      int64
 2   assign1  5 non-null      int64
 3   assign2  5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 292.0+ bytes